In [1]:
import sqlite3
import pandas as pd

In [2]:
import sqlite3
conn = sqlite3.connect('my_database_pract.db')
c = conn.cursor()

In [3]:
c.execute('''Drop Table _table''')

In [4]:
 c.execute('''CREATE TABLE _table(firstname text, lastname text Primary key)''')

In [5]:
c.execute('''INSERT INTO _table VALUES('Muhammad','Aaqib')''')

In [6]:
sql = pd.read_sql('''SELECT * FROM _table''',conn)
sql

  firstname lastname
0  Muhammad    Aaqib

In [7]:
 c.execute('''CREATE TABLE _table1(firstname text, l_name text)''')

In [8]:
c.execute('''INSERT INTO _table1 VALUES('Muhammad','Yasir')''')

In [9]:
sql = pd.read_sql('''SELECT * FROM _table1''',conn)
sql

  firstname l_name
0  Muhammad  Yasir

In [11]:
c.execute('''ALTER TABLE _table1 
            ADD Constraint fk
            FOREIGN KEY (l_name) REFERENCES _table(lastname)''')

OperationalError: near "Constraint": syntax error

In [10]:
c.execute('''ATTACH DATABASE my_database2 AS merge_db''')

In [11]:
c.execute('''DROP TABLE merge''')

In [12]:
 c.execute('''CREATE TABLE merge(firstname text, lastname text)''')

In [13]:
c.execute('''INSERT INTO merge SELECT * FROM _table ''')

In [14]:
c.execute('''INSERT INTO merge SELECT * FROM _table1''')

In [15]:
sql_ = pd.read_sql('''SELECT * FROM merge''',conn)
sql_

  firstname lastname
0  Muhammad    Aaqib
1  Muhammad    Yasir

In [16]:
count = pd.read_sql('''SELECT COUNT(*) FROM merge''',conn) 
count

   COUNT(*)
0         2

In [20]:
c.execute('''ALter Table _table
            ADD  primary key(lastname) ''')

OperationalError: near "primary": syntax error

In [26]:
key=pd.read_sql('''ALTER TABLE merge
             ADD b text PRIMARY KEY(firstname)  ''',conn)

DatabaseError: Execution failed on sql 'ALTER TABLE merge
             ADD COLUMN b text PRIMARY KEY(firstname)  ': near "(": syntax error

In [22]:
count = pd.read_sql('''SELECT * FROM merge''',conn) 
count

  firstname lastname    a_     a
0  Muhammad    Aaqib  None  None
1  Muhammad    Yasir  None  None